In [ ]:
## Relating dictionary and dataframe  #####

In [4]:
import pandas as pd


## this is from dictionary  # writing to csv using pandas

info = {'name':[],'age':[],'address':[],'phone':[]}  # this structure is a good way to create dataframe## as dict ko key is column ko name
n = int(input("Enter n = "))
for i in range(n):
    name = input("Enter name = ")
    age = input("Enter age = ")
    address = input("Enter address = ")
    phone= input("Enter phone= ")
    info['name'].append(name)
    info['age'].append(age)
    info['address'].append(address)
    info['phone'].append(phone)


    
print(info)

## converting to dataframe

df = pd.DataFrame(info)
df.to_csv('info.csv')
df

Enter n = 2
Enter name = Ram
Enter age = 45
Enter address = Kathmandu
Enter phone= 9812552554
Enter name = Shyam
Enter age = 66
Enter address = Lalitpur
Enter phone= 9812552254
{'name': ['Ram', 'Shyam'], 'age': ['45', '66'], 'address': ['Kathmandu', 'Lalitpur'], 'phone': ['9812552554', '9812552254']}

    name age    address       phone
0    Ram  45  Kathmandu  9812552554
1  Shyam  66   Lalitpur  9812552254

In [11]:
## writing to CSV (One by one)   =using CSV package  == adding list to csv file

import csv
l = [2,'Sabin',45,'Bara','9812554660']  # we will add this to above
file = open('info.csv','a')
x = csv.writer(file)
x.writerow(l)    # write row matra xa not rows
file.close()

In [12]:
import pandas as pd
df = pd.read_csv('info.csv')
df

   sn   name  age    address       phone
0   0    Ram   45  Kathmandu  9812552554
1   1  Shyam   66   Lalitpur  9812552254
2   2  Sabin   45       Bara  9812554660

In [14]:

## list inside list p1

import csv
import pandas as pd

l = [['sn','name','age','address','phone'],     ## cloumn name
    [1,'Ram', 45, 'Ktm',9845565421],
     [2,'Shyam', 66, 'Jhapa',9801266485], 
     [3,'Hari', 45, 'Lalitpur',9824756288]]

file = open('infonew.csv','a')      # 'file' is object -it holds operation... but mathiko 'l' is list
x = csv.writer(file)
x.writerows(l)     #### 'rows' not 'row'
file.close()

In [15]:
## list inside list p2
df = pd.read_csv('infonew.csv')
df

   sn   name  age   address       phone
0   1    Ram   45       Ktm  9845565421
1   2  Shyam   66     Jhapa  9801266485
2   3   Hari   45  Lalitpur  9824756288

In [17]:
## DictReader #####

    # csv file in dictionary

import csv
file = open('infonew.csv')
reader = csv.DictReader(file)
for row in reader:   # each row lai print garxa
    print(row)

{'sn': '1', 'name': 'Ram', 'age': '45', 'address': 'Ktm', 'phone': '9845565421'}
{'sn': '2', 'name': 'Shyam', 'age': '66', 'address': 'Jhapa', 'phone': '9801266485'}
{'sn': '3', 'name': 'Hari', 'age': '45', 'address': 'Lalitpur', 'phone': '9824756288'}

In [19]:
## DictReader #####

    # csv file in list inside dictionary
import csv
final_data =[]
file = open('infonew.csv')
reader = csv.DictReader(file)
for row in reader:   # each row lai print garxa
    final_data.append(row)
final_data     # now, we can change this data with previous concepts

[{'sn': '1',
  'name': 'Ram',
  'age': '45',
  'address': 'Ktm',
  'phone': '9845565421'},
 {'sn': '2',
  'name': 'Shyam',
  'age': '66',
  'address': 'Jhapa',
  'phone': '9801266485'},
 {'sn': '3',
  'name': 'Hari',
  'age': '45',
  'address': 'Lalitpur',
  'phone': '9824756288'}]

In [20]:
### DictWriter=
    # final_data lai feri csv ma  lane
    
import csv
csv_columns = ['sn','name','age','address','phone']
dicts = final_data

file = open('finaldata.csv','w')

writer = csv.DictWriter(file,fieldnames=csv_columns)   # yesle first ma column banauxa
writer.writeheader()                                   # yesle first ma column banauxa

writer.writerows(dicts)
file.close()

In [22]:
import pandas as pd
df = pd.read_csv('finaldata.csv')
df

   sn   name  age   address       phone
0   1    Ram   45       Ktm  9845565421
1   2  Shyam   66     Jhapa  9801266485
2   3   Hari   45  Lalitpur  9824756288

In [24]:
## Deleting rpws

import pandas as pd
df = pd.read_csv('finaldata.csv',index_col='sn')  # name ko basis ma hataune vaye= index_col'name, ani drop['Ram','Shyam']

df1 = df.drop([2,3],axis = 0) ## axis 0 bata 2 ra 3 drop hunxa     ## index col = sn lai banako xa so, - sn 2 r 3 janxa ## axis 0 chai row 
df1   # sn 2 ra 3 drop vayo from 'df'

   name  age address       phone
sn
1   Ram   45     Ktm  9845565421

In [25]:
import pandas as pd
df = pd.read_csv('finaldata.csv',index_col='sn')

df1 = df.drop(['address','phone'],axis = 1)  # i.e it is like use cols
df1

     name  age
sn
1     Ram   45
2   Shyam   66
3    Hari   45